FV2404/E_0221.dot
digraph D {
    labelloc="t";
    label=<<B><FONT POINT-SIZE="18">WiM Strom</FONT></B><BR/><BR/><B><FONT POINT-SIZE="16">9.19.1: AD: Anforderung Wert vom LF</FONT></B><BR/><BR/><BR/><BR/>>;
    "Start" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label=<<B>E_0221</B><BR align="center"/><FONT point-size="12"><B><U>Prüfende Rolle:</U> MSB</B></FONT><BR align="center"/>>];
    "1" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>1: </B>Wird die Übermittlung von Werten an die Marktrolle ESA grundsätzlich angeboten?<BR align="left"/>>];
    "A01" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A01</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der MSB bietet keine freiwillige Übermittlung von Werten an die Marktrolle ESA an.<BR align="left"/></FONT>>];
    "2" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>2: </B>Wird das vom ESA gewünschte Messprodukt entsprechend der Codeliste der Messprodukte angeboten?<BR align="left"/>>];
    "A02" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A02</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Das vom ESA gewünschte Messprodukt wird vom MSB nicht angeboten.<BR align="left"/></FONT>>];
    "3" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>3: </B>Liegt die vertragliche Grundlage zur Anfrage und Übermittlung der Werte und Abrechnung der erbrachten Dienstleistung vom MSB an den ESA beim MSB vor?<BR align="left"/>>];
    "A03" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A03</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Vertragliche Grundlage des ESA liegt nicht vor.<BR align="left"/></FONT>>];
    "4" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>4: </B>Liegt dem MSB eine gültige datenschutzrechtliche Einwilligung (wie z. B. das BDEW-Muster „Einwilligungserklärung in die Verarbeitung personenbezogener Daten nach DS-GVO - <BR align="left"/>Anfrage und Übermittlung von Messprodukten <BR align="left"/>gemäß BNetzA-Festlegung BK6-20-160“) zur Anfrage und Übermittlung von Messprodukten vor?<BR align="left"/>>];
    "A04" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A04</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die unterzeichnete Einwilligung des Anschlussnutzers für die Lokation liegt nicht vor<BR align="left"/></FONT>>];
    "5" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>5: </B>Sind die Daten in der Einwilligung plausibel und vollständig?<BR align="left"/>>];
    "A05" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A05</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Vorliegende Einwilligung ist nicht plausibel oder vollständig.<BR align="left"/></FONT>>];
    "6" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>6: </B>Ermöglicht die vorhandene Gerätetechnik die Übermittlung der angefragten Werte entsprechend dem Messprodukt?<BR align="left"/>>];
    "A06" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A06</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Die Gerätetechnik misst die angeforderten Messwerte nicht.<BR align="left"/></FONT>>];
    "7" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>7: </B>Handelt es sich um eine Anfrage von Werten auf Ebene der Marktlokation?<BR align="left"/>>];
    "Ende" [margin="0.2,0.12", shape=box, style=filled, fillcolor="#7a8da1", label="Ende"];
    "8" [margin="0.2,0.12", shape=box, style="filled,rounded", fillcolor="#7aab8a", label=<<B>8: </B>Ist der MSB an allen der Marktlokation zugeordneten Messlokationen auch der MSB der Messlokation(en)?<BR align="left"/>>];
    "A07" [margin="0.17,0.08", shape=box, style=filled, fillcolor="#cfb986", label=<<B>A07</B><BR align="center"/><FONT point-size="12"><U>Hinweis:</U><BR align="left"/>Cluster: Ablehnung<BR align="left"/>Der MSB der Marktlokation ist nicht zeitgleich der allen Messlokation(en) zugeordnete MSB.<BR align="left"/></FONT>>];

    "Start" -> "1";
    "1" -> "A01" [label="Nein"];
    "1" -> "2" [label="Ja"];
    "2" -> "A02" [label="Nein"];
    "2" -> "3" [label="Ja"];
    "3" -> "A03" [label="Nein"];
    "3" -> "4" [label="Ja"];
    "4" -> "A04" [label="Nein"];
    "4" -> "5" [label="Ja"];
    "5" -> "A05" [label="Nein"];
    "5" -> "6" [label="Ja"];
    "6" -> "A06" [label="Nein"];
    "6" -> "7" [label="Ja"];
    "7" -> "8" [label="Ja"];
    "7" -> "Ende" [label="Nein"];
    "8" -> "A07" [label="Nein"];
    "8" -> "Ende" [label="Ja"];

    bgcolor="transparent";
}
